---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.SpotLightDistribution
source: html/0cd2924a-50ee-d5e6-130d-81be53417ab3.htm
---
# SpotLightDistribution Properties

Specifies whether the .NET object represents a valid Revit entity.